tutorials/cylinder/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0.4 0 0);

boundaryField
{
    inlet
    {
//        type            timeVaryingMappedFixedValue;
//        mapMethod       nearest;
//        outOfBounds     clamp;
        type            inletOutlet;
        inletValue      uniform (0.4 0 0);
        value           uniform (0.4 0 0);
     }


    outlet
    {
        type            zeroGradient;
    }

    Bottom
    {
        type            noSlip;
//        value           uniform (0 0 0);
    }

    ledge
    {
        type            noSlip;
//        value           uniform (0 0 0);
    }
  	Top
    {
        type            slip;
    }

    cylinder
    {
        type            noSlip;
    }

    SideWalls
    {
        type            empty;
    }

}

// ************************************************************************* //
