tutorials/cylinder/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            zeroGradient;
//        type            inletOutlet;
//        inletValue      uniform 0;
//        value           uniform 0;
    }
    

    outlet
    {
        type            fixedValue;
//        outletValue     uniform 0;
        value           uniform 0;
    }

    Bottom
    {
        type            zeroGradient;
    }
        ledge
    {
        type            zeroGradient;
    }

	 Top
    {
        type            zeroGradient;
    }
	
    cylinder
    {
        type            zeroGradient;
    }  
    SideWalls
    {
        type            empty;
    }

}

// ************************************************************************* //
