tutorials/cylinder/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 0.0003;

boundaryField
{

    inlet
    {
        type            fixedValue;
        value           uniform 0.0003;
    }
    outlet
    {
        type            zeroGradient;
    }
    Bottom
    {
        type            epsilonWallFunction;
        value           uniform 0.0003;
    }    
    
    ledge
    {
        type            epsilonWallFunction;
        value           uniform 0.0003;
    }
    Top
    {
        type            zeroGradient;
    }
    SideWalls
    {
        type            empty;
    }
    cylinder
    {
        type            epsilonWallFunction;
        value           uniform 0.0003;
    }
}


// ************************************************************************* //
