tutorials/cylinder/0/surfDisplacement
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       areaVectorField;
    location    "0";
    object      surfDisplacement;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<vector> 
683
(
(-6.123230e-18 -0.000000e+00 -0.000000e+00)
(-6.123230e-18 -0.000000e+00 -0.000000e+00)
(-6.123230e-18 -0.000000e+00 -0.000000e+00)
(-6.123230e-18 -0.000000e+00 -0.000000e+00)
(-6.123230e-18 -0.000000e+00 -0.000000e+00)
(-6.123230e-18 -0.000000e+00 -0.000000e+00)
(-1.185341e-18 -0.000000e+00 -0.000000e+00)
(-2.403436e-18 -0.000000e+00 -0.000000e+00)
...
(6.123230e-18 0.000000e+00 0.000000e+00))
;

boundaryField
{
    default
    {
        type            calculated;
        value           uniform (0 0 0);
    }
}


// ************************************************************************* //
